tap "daipeihust/tap"
tap "felixkratz/formulae"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "bat"
brew "glib"
brew "cairo"
brew "fastfetch"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-lfs"
brew "go"
brew "jq"
brew "lazygit"
brew "libsass"
brew "lua"
brew "mise"
brew "neovim"
brew "node"
brew "nodebrew"
brew "nowplaying-cli"
brew "pnpm"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "stow"
brew "switchaudio-osx"
brew "tmux"
brew "tree"
brew "yt-dlp"
brew "zsh-syntax-highlighting"
brew "daipeihust/tap/im-select"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "nikitabobko/tap/aerospace"
cask "claude"
cask "claude-code"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-sf-pro"
cask "ghostty"
cask "homerow"
cask "iterm2"
cask "karabiner-elements"
cask "notion"
cask "notion-mail"
cask "obsidian"
cask "psychopy"
cask "rstudio"
cask "sf-symbols"
cask "steam"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "anandkothari.petals-pastels"
vscode "asvetliakov.vscode-neovim"
vscode "atomiks.moonlight"
vscode "avetis.tokyo-night"
vscode "bceskavich.theme-dracula-at-night"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "janisdd.vscode-edit-csv"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.winteriscoming"
vscode "kevinrose.vsc-python-indent"
vscode "liviuschera.noctis"
vscode "mechatroner.rainbow-csv"
vscode "mosapride.zenkaku"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "mshr-h.veriloghdl"
vscode "pkief.material-icon-theme"
vscode "rettimo.nextjs-vscode-snippets"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "sazumiviki.kawaine-theme"
vscode "sdras.night-owl"
vscode "shyykoserhiy.vscode-spotify"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "wesbos.theme-cobalt2"
vscode "zignd.html-css-class-completion"
vscode "zylve.noctis-italicized"
